Repository: soyeht/soyeht-ios
Catalog: TerminalApp/Soyeht/Localizable.xcstrings
Source language: en
Languages: ar, bn, de, es, fr, hi, id, ja, ko, pt_br, pt_pt, ru, ur, zh_hans

# settings.pairedMacs.lastSeen
source: Last seen: %@
ar: آخر ظهور: %@
bn: শেষ: %@
de: Zuletzt: %@
es: Última vez: %@
fr: Dernière fois : %@
hi: अंतिम: %@
id: Terakhir: %@
ja: 最終利用: %@
ko: 마지막 사용: %@
pt_br: Último uso: %@
pt_pt: Última utilização: %@
ru: Последний раз: %@
ur: آخری بار: %@
zh_hans: 上次使用：%@

# settings.pairedMacs.remove.confirm
source: Remove “%@”
ar: إزالة "%@"
bn: "%@" সরান
de: „%@“ entfernen
es: Quitar “%@”
fr: Supprimer « %@ »
hi: "%@" हटाएँ
id: Hapus “%@”
ja: 「%@」を削除
ko: “%@” 제거
pt_br: Remover “%@”
pt_pt: Remover “%@”
ru: Удалить «%@»
ur: "%@" کو ہٹائیں
zh_hans: 移除“%@”

# settings.pairedMacs.remove.message
source: The pairing secret will be deleted. To pair again, scan a new QR on the Mac.
ar: سيتم حذف سرّ الاقتران. للإقران مرة أخرى، امسح رمز QR جديدًا على Mac.
bn: পেয়ারিং সিক্রেট মুছে ফেলা হবে। আবার পেয়ার করতে Mac-এ নতুন QR স্ক্যান করুন।
de: Das Kopplungsgeheimnis wird gelöscht. Um erneut zu koppeln, scannen Sie einen neuen QR auf dem Mac.
es: Se eliminará el secreto de emparejamiento. Para volver a emparejar, escanea un nuevo QR en el Mac.
fr: Le secret d’appairage sera supprimé. Pour re-appairer, scannez un nouveau QR sur le Mac.
hi: पेयरिंग सीक्रेट हटा दिया जाएगा। दोबारा पेयर करने के लिए Mac पर नया QR स्कैन करें।
id: Rahasia pasangan akan dihapus. Untuk memasangkan lagi, pindai QR baru di Mac.
ja: ペアリング シークレットが削除されます。再度ペアリングするには、Mac で新しい QR をスキャンしてください。
ko: 페어링 비밀이 삭제됩니다. 다시 페어링하려면 Mac에서 새 QR을 스캔하세요.
pt_br: O segredo de pareamento será apagado. Para parear novamente, escaneie um novo código QR no Mac.
pt_pt: O segredo de emparelhamento será apagado. Para voltar a emparelhar, leia um novo QR no Mac.
ru: Секрет сопряжения будет удалён. Чтобы снова сопрячься, отсканируйте новый QR на Mac.
ur: جوڑی کا راز حذف ہو جائے گا۔ دوبارہ جوڑنے کے لیے Mac پر نیا QR اسکین کریں۔
zh_hans: 配对密钥将被删除。若要重新配对，请在 Mac 上扫描新的 QR。

# settings.pairedMacs.remove.title
source: Remove this Mac?
ar: إزالة هذا الـ Mac؟
bn: এই Mac সরাবেন?
de: Diesen Mac entfernen?
es: ¿Quitar este Mac?
fr: Supprimer ce Mac ?
hi: इस Mac को हटाएँ?
id: Hapus Mac ini?
ja: この Mac を削除しますか？
ko: 이 Mac을 제거할까요?
pt_br: Remover este Mac?
pt_pt: Remover este Mac?
ru: Удалить этот Mac?
ur: اس Mac کو ہٹائیں؟
zh_hans: 移除此 Mac？

# settings.pairedMacs.section.trusted
source: // trusted Macs
ar: // أجهزة Mac الموثوقة
ja: // 信頼済みの Mac
ko: // 신뢰하는 Mac
pt_br: // Macs confiáveis
pt_pt: // Macs de confiança
zh_hans: // 受信任的 Mac

# settings.pairedMacs.section.trusted.description
source: Paired iPhones can open panes on these Macs without asking for confirmation. Remove here to cut access.
ar: يمكن لأجهزة iPhone المقترنة فتح لوحات على أجهزة Mac هذه دون طلب تأكيد. أزلها هنا لقطع الوصول.
bn: পেয়ার করা iPhone এই Macs-এ নিশ্চিতকরণ ছাড়াই pane খুলতে পারে। অ্যাক্সেস কাটতে এখান থেকে সরান।
de: Gekoppelte iPhones können Bereiche auf diesen Macs ohne Bestätigung öffnen. Hier entfernen, um den Zugriff zu beenden.
es: Los iPhones emparejados pueden abrir panes en estos Macs sin pedir confirmación. Quita aquí para cortar el acceso.
fr: Les iPhones appairés peuvent ouvrir des volets sur ces Macs sans confirmation. Supprimez ici pour couper l’accès.
hi: पेयर किए गए iPhones इन Macs पर बिना पुष्टि के pane खोल सकते हैं। एक्सेस काटने के लिए यहाँ से हटाएँ।
id: iPhone yang dipasangkan dapat membuka pane pada Mac ini tanpa konfirmasi. Hapus di sini untuk memutus akses.
ja: ペアリング済みの iPhone は確認なしにこれらの Mac でペインを開けます。アクセスを切るにはここで削除してください。
ko: 페어링된 iPhone은 확인 없이 이 Mac들에서 패널을 열 수 있습니다. 접근을 차단하려면 여기에서 제거하세요.
pt_br: iPhones pareados podem abrir painéis nestes Macs sem pedir confirmação. Remova aqui para cortar o acesso.
pt_pt: iPhones emparelhados podem abrir painéis nestes Macs sem pedir confirmação. Remova aqui para cortar o acesso.
ru: Сопряжённые iPhone могут открывать panes на этих Mac без подтверждения. Удалите здесь, чтобы закрыть доступ.
ur: جوڑی شدہ iPhones ان Macs پر تصدیق مانگے بغیر panes کھول سکتے ہیں۔ رسائی ختم کرنے کے لیے یہاں سے ہٹائیں۔
zh_hans: 已配对的 iPhone 可以在这些 Mac 上无需确认地打开窗格。要断开访问，请在这里移除。

# settings.pairedMacs.title
source: Paired Macs
ar: أجهزة Mac المقترنة
bn: পেয়ার করা Macs
de: Gekoppelte Macs
es: Macs emparejados
fr: Macs appairés
hi: पेयर किए गए Macs
id: Mac yang dipasangkan
ja: ペア済み Mac
ko: 페어링된 Mac
pt_br: Macs pareados
pt_pt: Macs emparelhados
ru: Сопряжённые Macs
ur: جوڑی شدہ Macs
zh_hans: 已配对的 Mac

# settings.row.colorTheme
source: Color Theme
ar: نسق الألوان
bn: রঙের থিম
de: Farbthema
es: Tema de color
fr: Thème de couleurs
hi: रंग थीम
id: Tema warna
ja: カラーテーマ
ko: 색상 테마
pt_br: Tema de cores
pt_pt: Tema de cores
ru: Цветовая тема
ur: رنگ کی تھیم
zh_hans: 颜色主题

# settings.row.cursorStyle
source: Cursor Style
ar: نمط المؤشر
bn: কার্সার শৈলী
de: Cursor-Stil
es: Estilo de cursor
fr: Style de curseur
hi: कर्सर शैली
id: Gaya kursor
ja: カーソルスタイル
ko: 커서 스타일
pt_br: Estilo do cursor
pt_pt: Estilo do cursor
ru: Стиль курсора
ur: کرسر کا انداز
zh_hans: 光标样式

# settings.row.fontSize
source: Font Size
ar: حجم الخط
bn: ফন্ট আকার
de: Schriftgröße
es: Tamaño de fuente
fr: Taille de police
hi: फ़ॉन्ट आकार
id: Ukuran font
ja: フォントサイズ
ko: 글꼴 크기
pt_br: Tamanho da fonte
pt_pt: Tamanho do tipo de letra
ru: Размер шрифта
ur: فونٹ سائز
zh_hans: 字体大小

# settings.row.hapticFeedback
source: Haptic Feedback
ar: استجابة لمسية
bn: হ্যাপটিক ফিডব্যাক
de: Haptisches Feedback
es: Respuesta háptica
fr: Retour haptique
hi: हैप्टिक फ़ीडबैक
id: Umpan balik haptik
ja: 触覚フィードバック
ko: 햅틱 피드백
pt_br: Retorno tátil
pt_pt: Resposta háptica
ru: Тактильный отклик
ur: ہیپٹک فیڈ بیک
zh_hans: 触感反馈

# settings.row.pairedMacs
source: Paired Macs
ar: أجهزة Mac المقترنة
bn: পেয়ার করা Mac
de: Gekoppelte Macs
es: Macs vinculados
fr: Macs appairés
hi: पेयर किए गए Mac
id: Mac yang dipasangkan
ja: ペアリング済みMac
ko: 페어링된 Mac
pt_br: Macs pareados
pt_pt: Macs emparelhados
ru: Сопряжённые Mac
ur: جوڑے ہوئے Mac
zh_hans: 已配对的 Mac

# settings.row.shortcutBar
source: Shortcut Bar
ar: شريط الاختصارات
bn: শর্টকাট বার
de: Shortcut-Leiste
es: Barra de atajos
fr: Barre de raccourcis
hi: शॉर्टकट बार
id: Bilah pintasan
ja: ショートカットバー
ko: 단축키 막대
pt_br: Barra de atalhos
pt_pt: Barra de atalhos
ru: Панель быстрого доступа
ur: شارٹ کٹ بار
zh_hans: 快捷栏

# settings.row.voiceInput
source: Voice Input
ar: إدخال صوتي
bn: ভয়েস ইনপুট
de: Spracheingabe
es: Entrada de voz
fr: Entrée vocale
hi: वॉइस इनपुट
id: Masukan Suara
ja: 音声入力
ko: 음성 입력
pt_br: Entrada de voz
pt_pt: Entrada por voz
ru: Голосовой ввод
ur: صوتی ان پٹ
zh_hans: 语音输入

# settings.section.terminal
source: // terminal settings
ar: // إعدادات الطرفية
de: // Terminaleinstellungen
es: // ajustes de terminal
fr: // réglages du terminal
ja: // ターミナル設定
ko: // 터미널 설정
pt_br: // ajustes do terminal
pt_pt: // definições do terminal
zh_hans: // 终端设置

# settings.section.terminal.description
source: Customize the appearance and behavior of the terminal.
ar: خصّص مظهر وسلوك الطرفية.
bn: টার্মিনালের চেহারা এবং আচরণ কাস্টমাইজ করুন।
de: Passen Sie Aussehen und Verhalten des Terminals an.
es: Personaliza la apariencia y el comportamiento del terminal.
fr: Personnalisez l’apparence et le comportement du terminal.
hi: टर्मिनल की उपस्थिति और व्यवहार को अनुकूलित करें।
id: Sesuaikan tampilan dan perilaku terminal.
ja: ターミナルの外観と動作をカスタマイズします。
ko: 터미널의 모양과 동작을 사용자화합니다.
pt_br: Personalize a aparência e o comportamento do terminal.
pt_pt: Personalize a aparência e o comportamento do terminal.
ru: Настройте внешний вид и поведение терминала.
ur: ٹرمینل کی شکل اور رویے کو اپنی مرضی کے مطابق بنائیں۔
zh_hans: 自定义终端的外观和行为。

# settings.shortcut.creator.command.footer
source: The text will be typed into the terminal when you tap the button.
ar: ستتم كتابة النص في الطرفية عند الضغط على الزر.
bn: বোতাম চাপলে টেক্সট টার্মিনালে টাইপ হবে।
de: Der Text wird im Terminal eingegeben, wenn du den Button antippst.
es: El texto se escribirá en el terminal cuando pulses el botón.
fr: Le texte sera saisi dans le terminal quand tu appuieras sur le bouton.
hi: बटन दबाने पर टेक्स्ट टर्मिनल में टाइप हो जाएगा।
id: Teks akan diketik ke terminal saat kamu menyentuh tombol.
ja: ボタンをタップすると、テキストがターミナルに入力されます。
ko: 버튼을 탭하면 텍스트가 터미널에 입력됩니다.
pt_br: O texto será digitado no terminal quando você tocar no botão.
pt_pt: O texto será escrito no terminal quando tocar no botão.
ru: Текст будет введён в терминал при нажатии на кнопку.
ur: جب آپ بٹن دبائیں گے تو متن ٹرمینل میں ٹائپ ہو جائے گا۔
zh_hans: 轻点按钮时，文本会输入到终端。

# settings.shortcut.creator.command.placeholder
source: e.g. claude, git status, docker ps
ar: مثال: claude, git status, docker ps
bn: যেমন claude, git status, docker ps
de: z. B. claude, git status, docker ps
es: p. ej., claude, git status, docker ps
fr: p. ex. claude, git status, docker ps
hi: उदा. claude, git status, docker ps
id: mis. claude, git status, docker ps
ja: 例: claude, git status, docker ps
ko: 예: claude, git status, docker ps
pt_br: ex: claude, git status, docker ps
pt_pt: ex: claude, git status, docker ps
ru: например claude, git status, docker ps
ur: مثلاً claude, git status, docker ps
zh_hans: 例如 claude, git status, docker ps

# settings.shortcut.creator.command.section
source: // command to type
ar: // الأمر المطلوب كتابته
bn: // টাইপ করার কমান্ড
de: // einzugebender befehl
es: // comando a escribir
fr: // commande à saisir
hi: // टाइप करने के लिए कमांड
id: // perintah untuk diketik
ja: // 入力するコマンド
ko: // 입력할 명령
pt_br: // comando para digitar
pt_pt: // comando para escrever
ru: // команда для ввода
ur: // ٹائپ کرنے کے لیے کمانڈ
zh_hans: // 要输入的命令

# settings.shortcut.creator.description.placeholder
source: Description (optional)
ar: الوصف (اختياري)
bn: বিবরণ (ঐচ্ছিক)
de: Beschreibung (optional)
es: Descripción (opcional)
fr: Description (facultative)
hi: विवरण (वैकल्पिक)
id: Deskripsi (opsional)
ja: 説明 (任意)
ko: 설명 (선택 사항)
pt_br: Descrição (opcional)
pt_pt: Descrição (opcional)
ru: Описание (необязательно)
ur: تفصیل (اختیاری)
zh_hans: 描述（可选）

# settings.shortcut.creator.description.section
source: // what does this shortcut do?
ar: // ماذا يفعل هذا الاختصار؟
bn: // এই শর্টকাট কী করে?
de: // was bewirkt dieser shortcut?
es: // ¿qué hace este atajo?
fr: // que fait ce raccourci ?
hi: // यह शॉर्टकट क्या करता है?
id: // apa fungsi pintasan ini?
ja: // このショートカットの動作は？
ko: // 이 단축키는 무엇을 하나요?
pt_br: // o que este atalho faz?
pt_pt: // o que este atalho faz?
ru: // что делает этот ярлык?
ur: // یہ شارٹ کٹ کیا کرتا ہے؟
zh_hans: // 这个快捷键做什么？

# settings.shortcut.creator.hint.keyCombo.1
source: Ctrl+C interrupt process
ar: Ctrl+C إيقاف العملية
bn: Ctrl+C প্রক্রিয়া বাতিল
de: Ctrl+C Prozess unterbrechen
es: Ctrl+C interrumpir proceso
fr: Ctrl+C interrompre le processus
hi: Ctrl+C प्रक्रिया रोकें
id: Ctrl+C hentikan proses
ja: Ctrl+C プロセスを中断
ko: Ctrl+C 프로세스 중단
pt_br: Ctrl+C interromper processo
pt_pt: Ctrl+C interromper processo
ru: Ctrl+C прервать процесс
ur: Ctrl+C عمل کو روکیں
zh_hans: Ctrl+C 中断进程

# settings.shortcut.creator.hint.keyCombo.2
source: Ctrl+D send EOF (exit shell)
ar: Ctrl+D إرسال EOF (الخروج من الـshell)
bn: Ctrl+D EOF পাঠান (শেল থেকে বেরিয়ে যান)
de: Ctrl+D EOF senden (Shell verlassen)
es: Ctrl+D enviar EOF (salir del shell)
fr: Ctrl+D envoyer EOF (quitter le shell)
hi: Ctrl+D EOF भेजें (शेल से बाहर)
id: Ctrl+D kirim EOF (keluar shell)
ja: Ctrl+D EOF を送信 (シェル終了)
ko: Ctrl+D EOF 전송 (셸 종료)
pt_br: Ctrl+D enviar EOF (sair do shell)
pt_pt: Ctrl+D enviar EOF (sair do shell)
ru: Ctrl+D отправить EOF (выход из shell)
ur: Ctrl+D EOF بھیجیں (شیل سے باہر)
zh_hans: Ctrl+D 发送 EOF（退出 shell）

# settings.shortcut.creator.hint.keyCombo.3
source: Ctrl+Z suspend process
ar: Ctrl+Z تعليق العملية
bn: Ctrl+Z প্রক্রিয়া স্থগিত
de: Ctrl+Z Prozess anhalten
es: Ctrl+Z suspender proceso
fr: Ctrl+Z suspendre le processus
hi: Ctrl+Z प्रक्रिया निलंबित करें
id: Ctrl+Z jeda proses
ja: Ctrl+Z プロセスを一時停止
ko: Ctrl+Z 프로세스 일시 중지
pt_br: Ctrl+Z suspender processo
pt_pt: Ctrl+Z suspender processo
ru: Ctrl+Z приостановить процесс
ur: Ctrl+Z عمل کو معطل کریں
zh_hans: Ctrl+Z 挂起进程

# settings.shortcut.creator.hint.textCommand.1
source: claude start Claude Code
ar: claude تشغيل Claude Code
bn: claude Claude Code শুরু
de: claude Claude Code starten
es: claude iniciar Claude Code
fr: claude démarrer Claude Code
hi: claude Claude Code शुरू करें
id: claude jalankan Claude Code
ja: claude Claude Code を起動
ko: claude Claude Code 시작
pt_br: claude iniciar o Claude Code
pt_pt: claude iniciar o Claude Code
ru: claude запустить Claude Code
ur: claude Claude Code شروع کریں
zh_hans: claude 启动 Claude Code

# settings.shortcut.creator.hint.textCommand.2
source: git status check repo state
ar: git status تحقق من حالة المستودع
bn: git status রেপো স্ট্যাটাস দেখুন
de: git status Repo-Zustand prüfen
es: git status comprobar estado del repo
fr: git status vérifier l’état du repo
hi: git status रेपो स्थिति देखें
id: git status cek status repo
ja: git status リポジトリの状態を確認
ko: git status 저장소 상태 확인
pt_br: git status verificar estado do repo
pt_pt: git status verificar estado do repo
ru: git status проверить состояние репозитория
ur: git status ریپو کی حالت چیک کریں
zh_hans: git status 检查仓库状态

# settings.shortcut.creator.hint.textCommand.3
source: docker ps list containers
ar: docker ps عرض الحاويات
bn: docker ps কন্টেইনার তালিকা
de: docker ps Container auflisten
es: docker ps listar contenedores
fr: docker ps lister les conteneurs
hi: docker ps कंटेनर सूची
id: docker ps daftar kontainer
ja: docker ps コンテナを一覧表示
ko: docker ps 컨테이너 목록 보기
pt_br: docker ps listar contêineres
pt_pt: docker ps listar contentores
ru: docker ps список контейнеров
ur: docker ps کنٹینرز کی فہرست
zh_hans: docker ps 列出容器

# settings.shortcut.creator.hint.textCommand.4
source: ls -la list all files
ar: ls -la عرض كل الملفات
bn: ls -la সব ফাইল তালিকা
de: ls -la alle Dateien auflisten
es: ls -la listar todos los archivos
fr: ls -la lister tous les fichiers
hi: ls -la सभी फ़ाइलें सूचीबद्ध करें
id: ls -la daftar semua berkas
ja: ls -la すべてのファイルを一覧表示
ko: ls -la 모든 파일 목록 보기
pt_br: ls -la listar todos os arquivos
pt_pt: ls -la listar todos os ficheiros
ru: ls -la список всех файлов
ur: ls -la تمام فائلوں کی فہرست
zh_hans: ls -la 列出所有文件

# settings.shortcut.creator.hints.section
source: // hints
ar: // تلميحات
bn: // ইঙ্গিত
de: // hinweise
es: // consejos
fr: // astuces
hi: // संकेत
id: // tips
ja: // ヒント
ko: // 힌트
pt_br: // dicas
pt_pt: // dicas
ru: // подсказки
ur: // اشارے
zh_hans: // 提示

# settings.shortcut.creator.key.section
source: // choose a key
ar: // اختر مفتاحاً
bn: // কী নির্বাচন করুন
de: // taste wählen
es: // elige una tecla
fr: // choisis une touche
hi: // कुंजी चुनें
id: // pilih tombol
ja: // キーを選択
ko: // 키 선택
pt_br: // escolha uma tecla
pt_pt: // escolha uma tecla
ru: // выберите клавишу
ur: // کی منتخب کریں
zh_hans: // 选择按键

# settings.shortcut.creator.label.footer
source: Name shown on the button. Leave empty for auto.
ar: الاسم الظاهر على الزر. اتركه فارغاً للتلقائي.
bn: বোতামে দেখানো নাম। স্বয়ংক্রিয়ের জন্য খালি রাখুন।
de: Der auf dem Button angezeigte Name. Leer lassen für Auto.
es: Nombre que se muestra en el botón. Déjalo vacío para auto.
fr: Nom affiché sur le bouton. Laisse vide pour auto.
hi: बटन पर दिखाया गया नाम। स्वतः के लिए खाली छोड़ें।
id: Nama yang ditampilkan pada tombol. Kosongkan untuk otomatis.
ja: ボタンに表示される名前。自動にする場合は空のままにします。
ko: 버튼에 표시될 이름입니다. 자동으로 하려면 비워 두세요.
pt_br: Nome exibido no botão. Deixe vazio para automático.
pt_pt: Nome apresentado no botão. Deixe vazio para automático.
ru: Имя на кнопке. Оставьте пустым для авто.
ur: بٹن پر دکھایا جانے والا نام۔ خودکار کے لیے خالی چھوڑیں۔
zh_hans: 显示在按钮上的名称。留空则自动生成。

# settings.shortcut.creator.label.placeholder
source: auto
ar: تلقائي
bn: স্বয়ংক্রিয়
hi: स्वतः
id: otomatis
ja: 自動
ko: 자동
pt_br: automático
pt_pt: automático
ru: авто
ur: خودکار
zh_hans: 自动

# settings.shortcut.creator.label.section
source: // toolbar button name
ar: // اسم زر شريط الأدوات
bn: // টুলবার বোতামের নাম
de: // button-name
es: // nombre del botón
fr: // nom du bouton
hi: // टूलबार बटन नाम
id: // nama tombol toolbar
ja: // ツールバー ボタン名
ko: // 도구 막대 버튼 이름
pt_br: // nome do botão da barra
pt_pt: // nome do botão da barra
ru: // имя кнопки панели
ur: // ٹول بار بٹن کا نام
zh_hans: // 工具栏按钮名称

# settings.shortcut.creator.mode.keyCombo
source: Key Combo
ar: اختصار مفاتيح
bn: কী কম্বো
de: Tastenkombination
es: Combinación de teclas
fr: Combinaison de touches
hi: कुंजी संयोजन
id: Kombinasi Tombol
ja: キーコンボ
ko: 키 조합
pt_br: Combinação de teclas
pt_pt: Combinação de teclas
ru: Сочетание клавиш
ur: کیز کا مجموعہ
zh_hans: 按键组合

# settings.shortcut.creator.mode.textCommand
source: Text Command
ar: أمر نصي
bn: টেক্সট কমান্ড
de: Textbefehl
es: Comando de texto
fr: Commande texte
hi: टेक्स्ट कमांड
id: Perintah Teks
ja: テキストコマンド
ko: 텍스트 명령
pt_br: Comando de texto
pt_pt: Comando de texto
ru: Текстовая команда
ur: ٹیکسٹ کمانڈ
zh_hans: 文本命令

# settings.shortcut.creator.modifier.section
source: // modifier
ar: // المعدّل
bn: // মডিফায়ার
de: // modifikator
es: // modificador
fr: // modificateur
hi: // संशोधक
id: // pengubah
ja: // 修飾キー
ko: // 수정 키
pt_br: // modificador
pt_pt: // modificador
ru: // модификатор
ur: // موڈیفائر
zh_hans: // 修饰键

# settings.shortcut.creator.preview.chooseCombo
source: Select a modifier and key
ar: اختر مفتاحاً معدّلاً ومفتاحاً
bn: একটি মডিফায়ার এবং কী নির্বাচন করুন
de: Modifikator und Taste wählen
es: Selecciona un modificador y una tecla
fr: Sélectionne un modificateur et une touche
hi: एक संशोधक और कुंजी चुनें
id: Pilih pengubah dan tombol
ja: 修飾キーとキーを選択してください
ko: 수정 키와 키를 선택하세요
pt_br: Selecione um modificador e uma tecla
pt_pt: Selecione um modificador e uma tecla
ru: Выберите модификатор и клавишу
ur: موڈیفائر اور کی منتخب کریں
zh_hans: 选择修饰键和按键

# settings.shortcut.creator.preview.section
source: // preview
ar: // معاينة
bn: // প্রিভিউ
de: // vorschau
es: // vista previa
fr: // aperçu
hi: // पूर्वावलोकन
id: // pratinjau
ja: // プレビュー
ko: // 미리보기
pt_br: // prévia
pt_pt: // pré-visualização
ru: // предпросмотр
ur: // پیش نظارہ
zh_hans: // 预览

# settings.shortcut.creator.preview.typeCommand
source: Type a command
ar: اكتب أمراً
bn: একটি কমান্ড লিখুন
de: Gib einen Befehl ein
es: Escribe un comando
fr: Saisis une commande
hi: कमांड टाइप करें
id: Ketik perintah
ja: コマンドを入力
ko: 명령 입력
pt_br: Digite um comando
pt_pt: Escreva um comando
ru: Введите команду
ur: کمانڈ ٹائپ کریں
zh_hans: 输入命令

# settings.shortcut.creator.title
source: New Shortcut
ar: اختصار جديد
bn: নতুন শর্টকাট
de: Neuer Shortcut
es: Nuevo atajo
fr: Nouveau raccourci
hi: नया शॉर्टकट
id: Pintasan Baru
ja: 新しいショートカット
ko: 새 단축키
pt_br: Novo atalho
pt_pt: Novo atalho
ru: Новый ярлык
ur: نیا شارٹ کٹ
zh_hans: 新建快捷键

# settings.shortcutBar.create.button
source: Create Custom Shortcut
ar: إنشاء اختصار مخصص
bn: কাস্টম শর্টকাট তৈরি
de: Benutzerdefinierten Shortcut erstellen
es: Crear atajo personalizado
fr: Créer un raccourci personnalisé
hi: कस्टम शॉर्टकट बनाएँ
id: Buat Pintasan Kustom
ja: カスタムショートカットを作成
ko: 사용자 지정 단축키 생성
pt_br: Criar atalho personalizado
pt_pt: Criar atalho personalizado
ru: Создать свой ярлык
ur: حسب ضرورت شارٹ کٹ بنائیں
zh_hans: 创建自定义快捷键

# settings.shortcutBar.create.footer
source: Presets apply an optimized key set for each workflow.
ar: تطبق الإعدادات مجموعة مفاتيح محسّنة لكل سير عمل.
bn: প্রিসেট প্রতিটি ওয়ার্কফ্লোর জন্য অপ্টিমাইজড কী সেট প্রয়োগ করে।
de: Presets wenden ein optimiertes Tastenset für jeden Workflow an.
es: Los ajustes aplican un conjunto de teclas optimizado para cada flujo de trabajo.
fr: Les presets appliquent un ensemble de touches optimisé pour chaque workflow.
hi: प्रीसेट प्रत्येक वर्कफ़्लो के लिए अनुकूलित कुंजी सेट लागू करते हैं।
id: Preset menerapkan set tombol yang dioptimalkan untuk setiap alur kerja.
ja: プリセットは、各ワークフローに最適化されたキーセットを適用します。
ko: 프리셋은 각 워크플로에 최적화된 키 세트를 적용합니다.
pt_br: Presets aplicam um conjunto de teclas otimizado para cada workflow.
pt_pt: As predefinições aplicam um conjunto de teclas otimizado para cada workflow.
ru: Пресеты применяют оптимизированный набор клавиш под каждый рабочий процесс.
ur: پری سیٹس ہر ورک فلو کے لیے بہتر کی سیٹ لاگو کرتے ہیں۔
zh_hans: 预设会为每个工作流应用优化后的按键集。

# settings.shortcutBar.preset.apply
source: Apply Preset
ar: تطبيق الإعداد
bn: প্রিসেট প্রয়োগ
de: Preset anwenden
es: Aplicar ajuste
fr: Appliquer le preset
hi: प्रीसेट लागू करें
id: Terapkan Preset
ja: プリセットを適用
ko: 프리셋 적용
pt_br: Aplicar preset
pt_pt: Aplicar predefinição
ru: Применить пресет
ur: پری سیٹ لاگو کریں
zh_hans: 应用预设

# settings.shortcutBar.preset.keyCount
source: %1$lld keys
ar: %1$lld مفاتيح
bn: %1$lld কী
de: %1$lld Tasten
es: %1$lld teclas
fr: %1$lld touches
hi: %1$lld कुंजियाँ
id: %1$lld tombol
ja: %1$lld キー
ko: %1$lld개 키
pt_br: %1$lld teclas
pt_pt: %1$lld teclas
ru: %1$lld клавиш
ur: %1$lld کیز
zh_hans: %1$lld 个按键

# settings.shortcutBar.section.active
source: // active shortcut keys
ar: // الاختصارات النشطة
bn: // সক্রিয় শর্টকাট
de: // aktive shortcuts
es: // atajos activos
fr: // raccourcis actifs
hi: // सक्रिय शॉर्टकट
id: // pintasan aktif
ja: // アクティブなショートカット
ko: // 활성 단축키
pt_br: // atalhos ativos
pt_pt: // atalhos ativos
ru: // активные сочетания
ur: // فعال شارٹ کٹس
zh_hans: // 活动快捷键

# settings.shortcutBar.section.active.description
source: Drag to reorder. Swipe to remove.
ar: اسحب لإعادة الترتيب. اسحب أفقياً للإزالة.
bn: পুনঃক্রম করতে টানুন। সরাতে সোয়াইপ করুন।
de: Zum Neuordnen ziehen. Zum Entfernen wischen.
es: Arrastra para reordenar. Desliza para eliminar.
fr: Fais glisser pour réorganiser. Balaie pour supprimer.
hi: क्रम बदलने के लिए खींचें। हटाने के लिए स्वाइप करें।
id: Seret untuk mengurutkan. Geser untuk menghapus.
ja: ドラッグで並べ替え。スワイプで削除。
ko: 드래그하여 순서를 바꾸고, 쓸어넘겨 제거하세요.
pt_br: Arraste para reordenar. Deslize para remover.
pt_pt: Arraste para reordenar. Deslize para remover.
ru: Перетащите, чтобы изменить порядок. Проведите, чтобы удалить.
ur: ترتیب دوبارہ کرنے کے لیے گھسیٹیں۔ ہٹانے کے لیے سوائپ کریں۔
zh_hans: 拖动可重新排序。轻扫可移除。

# settings.shortcutBar.section.available
source: // available shortcuts
ar: // الاختصارات المتاحة
bn: // উপলব্ধ শর্টকাট
de: // verfügbare shortcuts
es: // atajos disponibles
fr: // raccourcis disponibles
hi: // उपलब्ध शॉर्टकट
id: // pintasan tersedia
ja: // 利用可能なショートカット
ko: // 사용 가능한 단축키
pt_br: // atalhos disponíveis
pt_pt: // atalhos disponíveis
ru: // доступные сочетания
ur: // دستیاب شارٹ کٹس
zh_hans: // 可用快捷键

# settings.shortcutBar.section.presets
source: // workflow presets
ar: // إعدادات سير العمل
bn: // ওয়ার্কফ্লো প্রিসেট
es: // ajustes de flujo de trabajo
fr: // presets de workflow
hi: // वर्कफ़्लो प्रीसेट
id: // preset alur kerja
ja: // ワークフロー プリセット
ko: // 워크플로 프리셋
pt_br: // presets de workflow
pt_pt: // predefinições de workflow
ru: // пресеты рабочего процесса
ur: // ورک فلو پری سیٹس
zh_hans: // 工作流预设

# settings.shortcutBar.value.custom
source: Custom (%1$lld)
ar: مخصص (%1$lld)
bn: কাস্টম (%1$lld)
de: Benutzerdefiniert (%1$lld)
es: Personalizado (%1$lld)
fr: Personnalisé (%1$lld)
hi: कस्टम (%1$lld)
id: Kustom (%1$lld)
ja: カスタム (%1$lld)
ko: 사용자 지정 (%1$lld)
pt_br: Personalizado (%1$lld)
pt_pt: Personalizado (%1$lld)
ru: Пользовательская (%1$lld)
ur: حسب ضرورت (%1$lld)
zh_hans: 自定义（%1$lld）

# settings.shortcutBar.value.default
source: Default
ar: افتراضي
bn: ডিফল্ট
de: Standard
es: Predeterminado
fr: Par défaut
hi: डिफ़ॉल्ट
id: Bawaan
ja: デフォルト
ko: 기본값
pt_br: Padrão
pt_pt: Predefinido
ru: По умолчанию
ur: ڈیفالٹ
zh_hans: 默认

# settings.title
source: Settings
ar: الإعدادات
bn: সেটিংস
de: Einstellungen
es: Ajustes
fr: Réglages
hi: सेटिंग्स
id: Pengaturan
ja: 設定
ko: 설정
pt_br: Ajustes
pt_pt: Definições
ru: Настройки
ur: ترتیبات
zh_hans: 设置

# settings.value.off
source: Off
ar: معطّل
bn: বন্ধ
de: Aus
es: Desactivado
fr: Désactivé
hi: बंद
id: Nonaktif
ja: オフ
ko: 끔
pt_br: Desativado
pt_pt: Desativado
ru: Выкл.
ur: آف
zh_hans: 关闭

# settings.value.on
source: On
ar: مفعّل
bn: চালু
de: Ein
es: Activado
fr: Activé
hi: चालू
id: Aktif
ja: オン
ko: 켬
pt_br: Ativado
pt_pt: Ativado
ru: Вкл.
ur: آن
zh_hans: 开启
